In [1]:
import pandas as pd
import numpy as np

In [3]:
movies_df = pd.read_csv('Data/Input/movies.csv')
print(movies_df.shape)
movies_df.head()

(27278, 3)

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [5]:
userItem_df = pd.read_csv('Data/Input/tags.csv')
print(userItem_df.shape)
userItem_df.head()

(465564, 4)

   userId  movieId            tag   timestamp
0      18     4141    Mark Waters  1240597180
1      65      208      dark hero  1368150078
2      65      353      dark hero  1368150079
3      65      521  noir thriller  1368149983
4      65      592      dark hero  1368150078

In [14]:
df = pd.merge(userItem_df, movies_df, on='movieId', how='left')
df.shape

(465564, 6)

In [15]:
df = df[~df.isna()]
df.shape

(465564, 6)

In [16]:
df.drop_duplicates(subset=['userId','movieId'], inplace=True)

In [17]:
df.shape

(174844, 6)

In [18]:
df.head()

,userId,movieId,tag,timestamp,title,genres
0,18,4141,Mark Waters,1240597180,Head Over Heels (2001),Comedy|Romance
1,65,208,dark hero,1368150078,Waterworld (1995),Action|Adventure|Sci-Fi
2,65,353,dark hero,1368150079,"Crow, The (1994)",Action|Crime|Fantasy|Thriller
3,65,521,noir thriller,1368149983,Romeo Is Bleeding (1993),Crime|Thriller
4,65,592,dark hero,1368150078,Batman (1989),Action|Crime|Thriller